/********************************************************************************


 **** Copyright (C), 2025, Yuanlong Xu <Yono233@outlook.com>    ****
 **** All rights reserved                                       ****

 ********************************************************************************
 * File Name     : HiLPB_Split_CMD.c
 * Author        : yono
 * Date          : 2025-04-25
 * Version       : 1.0
********************************************************************************/
/**************************************************************************/
/*
    解析CMD分流
*/

/* Includes ------------------------------------------------------------------*/
#include <HiLPB_api.h>
/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private Constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

void HiLPB_Split_CMD(_HILPB_COM *pB)
{
    switch(pB->Parse.cmd)
    {
    /* 系统指令部分 */
    case 0x0000: // 控制系统指令
        break;
    /* 矩阵配置部分 */
    case 0x0020: // 控制矩阵配置指令
        break;
    case 0x0021: // 历史电流源配置
        break;
    case 0x0022: // 支路属性标记配置
        break;
    case 0x0023: // 矩阵综合影响参数配置
        break;
    case 0x0028: // 支路L导纳配置
        break;
    case 0x0029: // 支路C导纳配置
        break;
    case 0x002A: // 支路阻值导纳配置
        break;
    /* 仿真配置部分 */
    case 0x0040: // 控制仿真配置指令
        break;
    case 0x0041: // 电压数据输出端口配置
        break;
    case 0x0042: // 电流数据输出端口配置
        break;
    case 0x0043: // 电压数据输入端口配置
        break;
    case 0x0044: // 电流数据输入端口配置
        break;
    /* 运行强制指令部分 */
    case 0x0060: // 控制强制指令
        break;
    case 0x0061: // 强制电压设置
        break;
    case 0x0062: // 强制电流设置
        break;
    default:
        break;
    }
}